owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport_lump.c
/****************************************************************************
 * boards/spike-prime-hub/src/stm32_legoport_lump.c
 *
 * SPDX-License-Identifier: MIT
 * Copyright (c) 2018-2023 The Pybricks Authors
 *
 * LUMP UART protocol engine for SPIKE Prime Hub I/O ports (Issue #43).
 * Based on `pybricks/lib/pbio/drv/legodev/legodev_pup_uart.c`, ported from
 * Contiki protothreads to one NuttX kthread per port.
 *
 * Phase 2 scope (this commit): SYNC -> INFO -> ACK state machine.  After
 * a successful sync the kthread sends 100 ms `SYS_NACK` keepalive in a
 * minimal loop so the device stays alive long enough for `lump info <N>`
 * to inspect the populated `lump_device_info_s`.  DATA frame parsing,
 * mode selection, and `lump_send_data()` are deferred to Phase 3.
 *
 * Threading: one kthread per port (`SCHED_PRIORITY_DEFAULT`, 2 KB stack).
 * All six are created at boot in `stm32_legoport_lump_register()` and
 * sit blocked on a per-port wakeup sem.  The DCM handoff callback stores
 * the per-port `legoport_pin_s` pointer and posts the sem; the kthread
 * resumes from there, configures GPIO AF, opens the USART, and runs the
 * pybricks-derived sync sequence.
 *
 * On error / disconnect the kthread closes the USART, calls
 * `stm32_legoport_release_uart()` (which clears the DCM's CB pointer),
 * immediately re-registers the CB, and sleeps for an exponentially
 * lengthening backoff (100 ms -> 1 s -> 5 s -> 30 s) before re-blocking
 * on the wakeup sem for the next handoff.
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>
#include <debug.h>
#include <syslog.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/kthread.h>
#include <nuttx/mutex.h>
#include <nuttx/sched.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>
#include <nuttx/wdog.h>

#include <arch/board/board.h>
#include <arch/board/board_legoport.h>
#include <arch/board/board_lump.h>

#include "stm32.h"

#include "spike_prime_hub.h"
#include "stm32_legoport_uart_hw.h"

#ifdef CONFIG_LEGO_LUMP

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* LUMP wire format constants — see `pybricks/lib/lego/lego_uart.h`.
 * Reproduced here so we don't depend on pybricks headers.  Bit
 * positions match RM0430 §28 USART irrespective of host MCU.
 */

#define LUMP_MSG_TYPE_MASK    0xC0u
#define LUMP_MSG_TYPE_SYS     0x00u
#define LUMP_MSG_TYPE_CMD     0x40u
#define LUMP_MSG_TYPE_INFO    0x80u
#define LUMP_MSG_TYPE_DATA    0xC0u

#define LUMP_MSG_SIZE_MASK    0x38u
#define LUMP_MSG_SIZE_SHIFT   3
#define LUMP_MSG_CMD_MASK     0x07u

#define LUMP_SYS_SYNC         0x00u
#define LUMP_SYS_NACK         0x02u
#define LUMP_SYS_ACK          0x04u

#define LUMP_CMD_TYPE         0x00u
#define LUMP_CMD_MODES        0x01u
#define LUMP_CMD_SPEED        0x02u
#define LUMP_CMD_SELECT       0x03u
#define LUMP_CMD_WRITE        0x04u
#define LUMP_CMD_EXT_MODE     0x06u
#define LUMP_CMD_VERSION      0x07u

#define LUMP_INFO_NAME        0x00u
#define LUMP_INFO_RAW         0x01u
#define LUMP_INFO_PCT         0x02u
#define LUMP_INFO_SI          0x03u
#define LUMP_INFO_UNITS       0x04u
#define LUMP_INFO_MAPPING     0x05u
#define LUMP_INFO_FORMAT      0x80u
#define LUMP_INFO_MODE_PLUS_8 0x20u

#define LUMP_TYPE_ID_MIN      29u
#define LUMP_TYPE_ID_MAX      101u

/* Tracks which info frames we've received during SYNC.  Mirrors
 * pybricks `EV3_UART_INFO_FLAG_*`.  We only enforce the four required
 * ones (TYPE, MODES, INFO_NAME, INFO_FORMAT) per device.
 */

#define LUMP_IF_CMD_TYPE      (1u << 0)
#define LUMP_IF_CMD_MODES     (1u << 1)
#define LUMP_IF_CMD_SPEED     (1u << 2)
#define LUMP_IF_CMD_VERSION   (1u << 3)
#define LUMP_IF_INFO_NAME     (1u << 4)
#define LUMP_IF_INFO_FORMAT   (1u << 14)
#define LUMP_IF_REQUIRED      (LUMP_IF_CMD_TYPE | LUMP_IF_CMD_MODES | \
                               LUMP_IF_INFO_NAME | LUMP_IF_INFO_FORMAT)

/* Timing (per pybricks legodev_pup_uart.c constants).
 *  - 250 ms between RX bytes during SYNC/INFO before declaring a stall
 *  - 10 ms between sending ACK and changing baud
 *  - 100 ms keepalive period in DATA state
 */

#define LUMP_IO_TIMEOUT_MS         250u
#define LUMP_ACK_BAUD_DELAY_MS     10u
#define LUMP_KEEPALIVE_MS          100u

#define LUMP_DATA_RECV_SLICE_MS    20u
#define LUMP_DATA_MISS_LIMIT       6u  /* 6 missed keepalives = ~600 ms */

/* Per-port watchdog timeout.  Worst case for one DATA-loop iteration is
 * the recv_msg slice (~20 ms) + a full padded frame (35 bytes × 20 ms
 * timeout each at slow line = ~700 ms) + keepalive TX (~50 ms) + TX
 * drain.  2 seconds gives a comfortable margin.
 */

#define LUMP_WATCHDOG_MS           2000u

/* Baud rate band (pybricks `EV3_UART_SPEED_*`). */

#define LUMP_BAUD_INITIAL          115200u
#define LUMP_BAUD_FALLBACK         2400u
#define LUMP_BAUD_MAX              460800u

/* Backoff schedule (ms) on consecutive sync failures.  Index 5 ==
 * `LUMP_FAULT_BACKOFF` mode (30 s retries).
 */

static const uint32_t g_backoff_ms[] = { 100u, 1000u, 5000u, 30000u, 30000u };
#define LUMP_BACKOFF_MAX           4u

/* Receive scratch buffer.  Worst case: header + 32B payload + checksum +
 * info_type byte + EXT_MODE prefix.  pybricks uses LUMP_MAX_MSG_SIZE+3.
 */

#define LUMP_RX_MSG_BYTES          (32u + 3u)

/* Kthread setup */

#define LUMP_KTHREAD_STACK         2048
#define LUMP_KTHREAD_PRIO          SCHED_PRIORITY_DEFAULT

/****************************************************************************
 * Private Types
 ****************************************************************************/

enum lump_state_e
{
  LUMP_ST_IDLE = 0,    /* waiting for handoff */
  LUMP_ST_SYNCING,     /* sent CMD SPEED, waiting for first CMD TYPE */
  LUMP_ST_INFO,        /* receiving CMD/INFO frames before SYS ACK */
  LUMP_ST_DATA,        /* sync complete, Phase 2 = idle keepalive */
  LUMP_ST_ERR,         /* transient error — go through release/backoff */
};

struct lump_engine_s
{
  uint8_t  port;
  pid_t    kthread;

  /* DCM handoff handshake */

  const struct legoport_pin_s *pins;
  sem_t    wakeup;
  volatile bool handoff_pending;
  bool     dcm_cb_registered;

