owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport_lump.c
  /* Engine state machine */

  enum lump_state_e state;
  uint8_t  backoff_step;

  /* SYNC scratch (mirrors pybricks `_pbdrv_legodev_pup_uart_dev_t`) */

  uint32_t info_flags;
  uint8_t  new_mode;
  uint8_t  ext_mode;
  uint32_t new_baud_rate;
  uint8_t  err_count;

  /* RX scratch */

  uint8_t  rx_msg[LUMP_RX_MSG_BYTES];
  size_t   rx_msg_size;

  /* Last-N frame ring, dumped on timeout for diagnostic.  Each entry
   * is the header byte + first payload byte (cmd2) of a successfully
   * received frame.  Saved without a checksum or size — that's already
   * derivable from the header.
   */

#define LUMP_LASTN  8u
  uint8_t  last_hdr[LUMP_LASTN];
  uint8_t  last_cmd2[LUMP_LASTN];
  uint8_t  last_idx;
  uint8_t  last_count;

  /* Public, lock-protected info snapshot */

  mutex_t  info_lock;
  struct lump_device_info_s info;

  /* Phase 3: DATA-state plumbing */

  /* Pending TX requests posted by user-space ioctls / kernel API.  All
   * three guarded by `tx_lock`; the kthread drains them between byte
   * reads in the DATA loop.
   */

  mutex_t  tx_lock;
  bool     pending_select;
  uint8_t  pending_select_mode;
  bool     pending_send;
  uint8_t  pending_send_mode;
  uint8_t  pending_send_buf[LUMP_MAX_PAYLOAD];
  uint8_t  pending_send_len;

  /* Per-port DATA-frame ring served by `LEGOPORT_LUMP_POLL_DATA` ioctl
   * (used by `legoport lump watch <N>`).  The kthread is the producer;
   * `lump_pop_data_frame()` is the consumer.  Drops oldest on overflow.
   */

  mutex_t  dq_lock;
  struct lump_data_frame_s dq[LUMP_DATA_QUEUE];
  uint8_t  dq_head;
  uint8_t  dq_tail;
  uint8_t  dq_count;
  uint32_t dq_dropped;

  /* `lump_attach()` callback set, served by the kthread (lock-released
   * before fire to avoid deadlock — same-port re-entry is rejected by
   * `in_callback`).
   */

  mutex_t  cb_lock;
  bool     cb_attached;
  bool     in_callback;
  struct lump_callbacks_s cb;

  /* Phase 4: per-port watchdog supervisor.  Pets on each DATA-loop
   * iteration; if the kthread stalls > LUMP_WATCHDOG_MS, the wdog
   * callback (IRQ context) sets `wdog_stall` + posts the wakeup sem,
   * and the kthread context handles release/register/backoff (no
   * release_uart from IRQ context per the plan).
   */

  struct wdog_s wdog;
  volatile bool wdog_stall;

  /* Stats */

  uint32_t rx_bytes;
  uint32_t tx_bytes;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct lump_engine_s g_lump[BOARD_LEGOPORT_COUNT];
static bool g_lump_initialized;

/****************************************************************************
 * Forward Declarations
 ****************************************************************************/

static int  lump_handoff_cb(int port, const struct legoport_pin_s *pins,
                            void *priv);
static int  lump_kthread_entry(int argc, FAR char *argv[]);
static int  lump_run_session(struct lump_engine_s *e);
static int  lump_sync(struct lump_engine_s *e);
static int  lump_recv_msg(struct lump_engine_s *e, uint32_t timeout_ms);
static int  lump_parse_msg(struct lump_engine_s *e);
static int  lump_send_msg(struct lump_engine_s *e, uint8_t header,
                          const uint8_t *payload, size_t payload_len,
                          bool with_checksum);
static int  lump_send_sys(struct lump_engine_s *e, uint8_t sys_byte);
static int  lump_data_loop(struct lump_engine_s *e);
static void lump_reset_session_state(struct lump_engine_s *e);
static uint8_t lump_msg_payload_size(uint8_t header);

/****************************************************************************
 * Helpers
 ****************************************************************************/

/* Decoded payload size in bytes from a LUMP header. */

static uint8_t lump_msg_payload_size(uint8_t header)
{
  uint8_t code = (header & LUMP_MSG_SIZE_MASK) >> LUMP_MSG_SIZE_SHIFT;
  return (uint8_t)(1u << (code & 0x07));
}

/* Wire size of a complete LUMP frame from the header byte alone:
 *   SYS  : 1
 *   CMD  : 1 + payload + 1 (checksum)
 *   INFO : 1 + 1 (info_type) + payload + 1 (checksum)
 *   DATA : 1 + payload + 1 (checksum)
 */

static size_t lump_msg_total_size(uint8_t header)
{
  uint8_t mtype = header & LUMP_MSG_TYPE_MASK;

  if (mtype == LUMP_MSG_TYPE_SYS)
    {
      return 1u;
    }

  size_t total = 1u + lump_msg_payload_size(header) + 1u;
  if (mtype == LUMP_MSG_TYPE_INFO)
    {
      total += 1u;
    }

  return total;
}

static uint8_t lump_xor_checksum(const uint8_t *buf, size_t len)
{
  uint8_t cs = 0xff;
  for (size_t i = 0; i < len; i++)
    {
      cs ^= buf[i];
    }
  return cs;
}

static void lump_reset_session_state(struct lump_engine_s *e)
{
  e->state           = LUMP_ST_IDLE;
  e->info_flags      = 0;
  e->new_mode        = 0;
  e->ext_mode        = 0;
  e->new_baud_rate   = LUMP_BAUD_INITIAL;
  e->err_count       = 0;
  e->rx_msg_size     = 0;

  nxmutex_lock(&e->info_lock);
  memset(&e->info, 0, sizeof(e->info));
  nxmutex_unlock(&e->info_lock);

  /* Drop any stale TX requests + DATA queue from the previous session.
   * Callbacks survive — `lump_attach` registration outlives sessions
   * (a re-sync re-fires `on_sync` on next entry to DATA loop... well,
   * Phase 3 doesn't re-fire `on_sync` after re-sync; consumers track
   * the SYNCED flag transition themselves via lump_get_info polling
   * if they care.  #44/#45 motor/sensor drivers will likely just
   * re-attach after detach-on-disconnect.).
   */

  nxmutex_lock(&e->tx_lock);
  e->pending_select   = false;
  e->pending_send     = false;
  e->pending_send_len = 0;
  nxmutex_unlock(&e->tx_lock);

  nxmutex_lock(&e->dq_lock);
  e->dq_head    = 0;
  e->dq_tail    = 0;
  e->dq_count   = 0;
  e->dq_dropped = 0;
  nxmutex_unlock(&e->dq_lock);
}

/****************************************************************************
 * DCM handoff callback (DCM HPWORK context, prio 192)
 ****************************************************************************/

/* Called by the DCM (Issue #42) once `UNKNOWN_UART` is confirmed on the
 * port.  Per the contract, this MUST be lightweight — we only stash the
 * pin-descriptor pointer and post the per-port wakeup sem.  The real
 * work runs in the per-port kthread (priority 100, can block).
 *
 * Return OK so DCM transitions the port to LATCHED_UART_OWNED.
 */

static int lump_handoff_cb(int port, const struct legoport_pin_s *pins,
                           void *priv)
{
  struct lump_engine_s *e = (struct lump_engine_s *)priv;

  DEBUGASSERT(port >= 0 && port < BOARD_LEGOPORT_COUNT);
  DEBUGASSERT(e == &g_lump[port]);

  e->pins             = pins;
  e->handoff_pending  = true;

  /* Bump the sem at most once per pending handoff — kthread clears the
   * flag when it processes the request.  Multiple posts from this CB
   * cannot happen because DCM serialises invokes per port.
   */

