owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport_lump.c
  nxsem_post(&e->wakeup);
  return OK;
}

/****************************************************************************
 * RX path — read a complete LUMP frame
 ****************************************************************************/

/* Read one frame into `e->rx_msg`.  Sets `e->rx_msg_size` on success.
 * Returns 0 on success, -ETIMEDOUT on byte-level timeout, or other
 * negated errno.  The frame's checksum is validated for non-SYS types.
 */

static int lump_recv_msg(struct lump_engine_s *e, uint32_t timeout_ms)
{
  int ret;

  /* Header byte */

  ret = lump_uart_read_byte(e->port, &e->rx_msg[0], timeout_ms);
  if (ret < 0)
    {
      return ret;
    }
  e->rx_bytes++;

  size_t total = lump_msg_total_size(e->rx_msg[0]);
  if (total > sizeof(e->rx_msg))
    {
      return -EBADMSG;
    }

  for (size_t i = 1; i < total; i++)
    {
      ret = lump_uart_read_byte(e->port, &e->rx_msg[i], timeout_ms);
      if (ret < 0)
        {
          return ret;
        }
      e->rx_bytes++;
    }

  e->rx_msg_size = total;

  /* SYS frames have no checksum.  Other types verify XOR of header +
   * payload (+ info_type for INFO) against the trailing byte.
   */

  if (total > 1)
    {
      uint8_t cs = lump_xor_checksum(e->rx_msg, total - 1);
      if (cs != e->rx_msg[total - 1])
        {
          return -EILSEQ;
        }
    }

  return OK;
}

/****************************************************************************
 * TX path — assemble + send a frame
 ****************************************************************************/

/* SYS frames are a single byte (no checksum).  Used for SYS_ACK / SYS_NACK. */

static int lump_send_sys(struct lump_engine_s *e, uint8_t sys_byte)
{
  int ret = lump_uart_write(e->port, &sys_byte, 1, LUMP_IO_TIMEOUT_MS);
  if (ret == OK)
    {
      e->tx_bytes += 1;
    }
  return ret;
}

/* CMD / DATA frames: header + payload + xor checksum. */

static int lump_send_msg(struct lump_engine_s *e, uint8_t header,
                         const uint8_t *payload, size_t payload_len,
                         bool with_checksum)
{
  uint8_t buf[1 + 32 + 1];

  if (payload_len > 32)
    {
      return -EINVAL;
    }

  buf[0] = header;
  if (payload_len > 0 && payload != NULL)
    {
      memcpy(&buf[1], payload, payload_len);
    }

  size_t total = 1 + payload_len;

  if (with_checksum)
    {
      uint8_t cs = lump_xor_checksum(buf, total);
      buf[total] = cs;
      total += 1;
    }

  int ret = lump_uart_write(e->port, buf, total, LUMP_IO_TIMEOUT_MS);
  if (ret == OK)
    {
      e->tx_bytes += total;
    }
  return ret;
}

/* Encode a 4-byte little-endian uint32 (used for CMD SPEED payload). */

static void lump_put_u32_le(uint8_t *out, uint32_t v)
{
  out[0] = (uint8_t)(v & 0xff);
  out[1] = (uint8_t)((v >> 8) & 0xff);
  out[2] = (uint8_t)((v >> 16) & 0xff);
  out[3] = (uint8_t)((v >> 24) & 0xff);
}

static uint32_t lump_get_u32_le(const uint8_t *in)
{
  return (uint32_t)in[0] |
         ((uint32_t)in[1] << 8) |
         ((uint32_t)in[2] << 16) |
         ((uint32_t)in[3] << 24);
}

/* Header byte for a CMD frame.  Picks the smallest payload-size encoding
 * that fits.  Returns the encoded size class for the caller to pad.
 */

static uint8_t lump_cmd_header(uint8_t cmd, size_t payload_len,
                               size_t *padded_len_out)
{
  uint8_t size_code;
  size_t padded;

  if (payload_len <= 1)        { size_code = 0u; padded = 1; }
  else if (payload_len <= 2)   { size_code = 1u; padded = 2; }
  else if (payload_len <= 4)   { size_code = 2u; padded = 4; }
  else if (payload_len <= 8)   { size_code = 3u; padded = 8; }
  else if (payload_len <= 16)  { size_code = 4u; padded = 16; }
  else                         { size_code = 5u; padded = 32; }

  *padded_len_out = padded;
  return (uint8_t)(LUMP_MSG_TYPE_CMD |
                   ((size_code << LUMP_MSG_SIZE_SHIFT) & LUMP_MSG_SIZE_MASK) |
                   (cmd & LUMP_MSG_CMD_MASK));
}

/****************************************************************************
 * Frame parser — consume e->rx_msg and update engine state
 ****************************************************************************/

/* Returns 0 on a valid frame (state may transition), -EBADMSG to drop
 * the frame and continue, or -EILSEQ to abort the session.  Mirrors the
 * pybricks `pbdrv_legodev_pup_uart_parse_msg()` behaviour.
 */

static int lump_parse_msg(struct lump_engine_s *e)
{
  if (e->rx_msg_size == 0)
    {
      return -EBADMSG;
    }

  uint8_t header = e->rx_msg[0];
  uint8_t mtype  = header & LUMP_MSG_TYPE_MASK;
  uint8_t cmd    = header & LUMP_MSG_CMD_MASK;
  uint8_t mode   = cmd;
  uint8_t cmd2   = (e->rx_msg_size >= 2) ? e->rx_msg[1] : 0;

  if (mtype == LUMP_MSG_TYPE_INFO && (cmd2 & LUMP_INFO_MODE_PLUS_8))
    {
      mode += 8;
      cmd2 &= (uint8_t)~LUMP_INFO_MODE_PLUS_8;
    }
  else
    {
      mode += e->ext_mode;
    }

  if (mode >= LUMP_MAX_MODES)
    {
      /* We only carry mode_info[8] in the public struct; modes >= 8 are
       * silently dropped.  All the SPIKE/Technic/BOOST devices we plan
       * to support fit in this window.
       */
      return OK;
    }

  switch (mtype)
    {
      case LUMP_MSG_TYPE_SYS:
        if (cmd == LUMP_SYS_ACK)
          {
            if ((e->info_flags & LUMP_IF_REQUIRED) != LUMP_IF_REQUIRED)
              {
                syslog(LOG_WARNING,
                       "lump: port %c: ACK before required INFO (flags=%lx)\n",
                       'A' + e->port, (unsigned long)e->info_flags);
                return -EILSEQ;
              }

            nxmutex_lock(&e->info_lock);
            e->info.current_mode = e->new_mode;
            nxmutex_unlock(&e->info_lock);

            /* Pybricks transitions to STATUS_ACK at this point; we use
             * the same boundary to break out of the INFO loop and send
             * our SYS_ACK reply.
             */
          }
        break;

      case LUMP_MSG_TYPE_CMD:
        switch (cmd)
          {
            case LUMP_CMD_TYPE:
              {
                uint8_t type_id = e->rx_msg[1];
                if (type_id < LUMP_TYPE_ID_MIN ||
                    type_id > LUMP_TYPE_ID_MAX)
                  {
                    return -EBADMSG;
                  }
                e->info_flags |= LUMP_IF_CMD_TYPE;
                nxmutex_lock(&e->info_lock);
                e->info.type_id = type_id;
                nxmutex_unlock(&e->info_lock);
                break;
              }

            case LUMP_CMD_MODES:
              {
                if (e->info_flags & LUMP_IF_CMD_MODES)
                  {
                    return -EILSEQ;
                  }
                if (cmd2 > 7)  /* LUMP_MAX_MODE */
                  {
                    return -EILSEQ;
                  }
                uint8_t num_modes = (uint8_t)(cmd2 + 1);
                if (e->rx_msg_size > 5)
                  {
                    /* Powered Up extended-mode count in rx_msg[3] */
                    num_modes = (uint8_t)(e->rx_msg[3] + 1);
                  }

                if (num_modes > LUMP_MAX_MODES)
                  {
                    /* Cap at our compile-time max; the engine still
                     * SYNCs successfully, only modes >= MAX are unseen.
                     */
                    num_modes = LUMP_MAX_MODES;
                  }

                e->info_flags |= LUMP_IF_CMD_MODES;
                e->new_mode    = (uint8_t)(num_modes - 1);

