owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport_lump.c
                nxmutex_lock(&e->info_lock);
                e->info.num_modes = num_modes;
                nxmutex_unlock(&e->info_lock);
                break;
              }

            case LUMP_CMD_SPEED:
              {
                if (e->info_flags & LUMP_IF_CMD_SPEED)
                  {
                    return -EILSEQ;
                  }
                uint32_t speed = lump_get_u32_le(&e->rx_msg[1]);
                if (speed < LUMP_BAUD_FALLBACK || speed > LUMP_BAUD_MAX)
                  {
                    return -EILSEQ;
                  }
                e->info_flags    |= LUMP_IF_CMD_SPEED;
                e->new_baud_rate  = speed;
                break;
              }

            case LUMP_CMD_VERSION:
              {
                if (e->info_flags & LUMP_IF_CMD_VERSION)
                  {
                    return -EILSEQ;
                  }
                uint32_t fw = lump_get_u32_le(&e->rx_msg[1]);
                uint32_t hw = lump_get_u32_le(&e->rx_msg[5]);
                e->info_flags |= LUMP_IF_CMD_VERSION;

                nxmutex_lock(&e->info_lock);
                e->info.fw_version = fw;
                e->info.hw_version = hw;
                nxmutex_unlock(&e->info_lock);
                break;
              }

            case LUMP_CMD_EXT_MODE:
              e->ext_mode = e->rx_msg[1];
              break;

            case LUMP_CMD_WRITE:
              /* Not used during SYNC; ignore.  Phase 3 will route DATA
               * mode-write payloads via lump_send_data().
               */
              break;

            default:
              return -EBADMSG;
          }
        break;

      case LUMP_MSG_TYPE_INFO:
        switch (cmd2)
          {
            case LUMP_INFO_NAME:
              {
                /* Name starts at rx_msg[2] and is up to LUMP_MAX_NAME_LEN
                 * bytes; rx_msg[size-1] is the (already-validated)
                 * checksum.  Overwrite checksum with NUL for a safe
                 * C string.
                 */
                e->rx_msg[e->rx_msg_size - 1] = 0;
                const char *name = (const char *)&e->rx_msg[2];

                /* Reject ASCII outside printable letters (pybricks parity). */

                if (e->rx_msg[2] < 'A' || e->rx_msg[2] > 'z')
                  {
                    return -EBADMSG;
                  }

                e->info_flags |= LUMP_IF_INFO_NAME;
                e->new_mode    = mode;

                nxmutex_lock(&e->info_lock);
                strncpy(e->info.modes[mode].name, name, LUMP_MAX_NAME_LEN);
                e->info.modes[mode].name[LUMP_MAX_NAME_LEN] = 0;
                nxmutex_unlock(&e->info_lock);
                break;
              }

            case LUMP_INFO_RAW:
            case LUMP_INFO_PCT:
            case LUMP_INFO_SI:
              /* 8 bytes: two LE float32 (min, max).  We store them
               * verbatim; the public struct already lays them out as
               * `float`.  Phase 2 keeps these optional — devices skip
               * them sometimes.
               */
              if (e->rx_msg_size >= 11 && mode < LUMP_MAX_MODES)
                {
                  uint32_t a = lump_get_u32_le(&e->rx_msg[2]);
                  uint32_t b = lump_get_u32_le(&e->rx_msg[6]);
                  float fa, fb;
                  memcpy(&fa, &a, sizeof(fa));
                  memcpy(&fb, &b, sizeof(fb));

                  nxmutex_lock(&e->info_lock);
                  if (cmd2 == LUMP_INFO_RAW)
                    {
                      e->info.modes[mode].raw_min = fa;
                      e->info.modes[mode].raw_max = fb;
                    }
                  else if (cmd2 == LUMP_INFO_PCT)
                    {
                      e->info.modes[mode].pct_min = fa;
                      e->info.modes[mode].pct_max = fb;
                    }
                  else
                    {
                      e->info.modes[mode].si_min = fa;
                      e->info.modes[mode].si_max = fb;
                    }
                  nxmutex_unlock(&e->info_lock);
                }
              break;

            case LUMP_INFO_UNITS:
              {
                /* Up to 4-char units string.  rx_msg[size-1] is checksum. */
                size_t copy = e->rx_msg_size > 3 ? e->rx_msg_size - 3 : 0;
                if (copy > LUMP_MAX_UNITS_LEN)
                  {
                    copy = LUMP_MAX_UNITS_LEN;
                  }
                nxmutex_lock(&e->info_lock);
                memcpy(e->info.modes[mode].units, &e->rx_msg[2], copy);
                e->info.modes[mode].units[copy] = 0;
                nxmutex_unlock(&e->info_lock);
                break;
              }

            case LUMP_INFO_MAPPING:
              if (e->rx_msg_size >= 5)
                {
                  nxmutex_lock(&e->info_lock);
                  e->info.modes[mode].writable = (e->rx_msg[3] != 0);
                  nxmutex_unlock(&e->info_lock);
                }
              break;

            case LUMP_INFO_FORMAT:
              {
                if (e->new_mode != mode)
                  {
                    return -EILSEQ;
                  }
                if (e->rx_msg_size < 7)
                  {
                    return -EILSEQ;
                  }
                if ((e->info_flags & LUMP_IF_REQUIRED) !=
                    (LUMP_IF_REQUIRED & ~LUMP_IF_INFO_FORMAT))
                  {
                    /* Need TYPE/MODES/NAME before FORMAT can complete a
                     * mode.  Treat as protocol error (pybricks parity).
                     */
                    return -EILSEQ;
                  }

                e->info_flags |= LUMP_IF_INFO_FORMAT;

                nxmutex_lock(&e->info_lock);
                e->info.modes[mode].num_values = e->rx_msg[2];
                e->info.modes[mode].data_type  = e->rx_msg[3];
                nxmutex_unlock(&e->info_lock);

                if (e->new_mode > 0)
                  {
                    e->new_mode--;
                    /* Clear NAME / FORMAT bits for the next mode round-
                     * trip.  Pybricks line 436 does this: subsequent
                     * INFO_NAME re-sets them before INFO_FORMAT closes.
                     */
                    e->info_flags &= ~(LUMP_IF_INFO_NAME |
                                       LUMP_IF_INFO_FORMAT);
                  }
                break;
              }

            default:
              /* Unknown INFO subtype — silently drop (pybricks-style). */
              break;
          }
        break;

      case LUMP_MSG_TYPE_DATA:
        {
          /* Mode is the lower 3 bits of the header plus `ext_mode`
           * (CMD EXT_MODE adder).  Powered Up devices issue
           * `CMD EXT_MODE 0` / `CMD EXT_MODE 8` before each DATA group
           * to multiplex modes >= 8.
           */

          uint8_t data_mode = (uint8_t)((header & LUMP_MSG_CMD_MASK) +
                                        e->ext_mode);
          if (data_mode >= LUMP_MAX_MODES)
            {
              break;  /* unknown mode — drop silently */
            }

          uint8_t payload = lump_msg_payload_size(header);
          if (payload > LUMP_MAX_PAYLOAD)
            {
              break;
            }

          /* Update `current_mode` only on edge.  Cheap mutex round-trip
           * but only fires when the mode changes — DATA frames keep
           * coming at high rate.
           */

