owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport_lump.c
          nxmutex_lock(&e->info_lock);
          if (e->info.current_mode != data_mode)
            {
              e->info.current_mode = data_mode;
            }
          e->info.flags |= LUMP_FLAG_DATA_OK;
          nxmutex_unlock(&e->info_lock);

          /* Push into the user-facing data queue (drop oldest if full). */

          nxmutex_lock(&e->dq_lock);
          if (e->dq_count == LUMP_DATA_QUEUE)
            {
              e->dq_tail = (uint8_t)((e->dq_tail + 1) % LUMP_DATA_QUEUE);
              e->dq_count--;
              e->dq_dropped++;
            }
          struct lump_data_frame_s *slot = &e->dq[e->dq_head];
          slot->mode = data_mode;
          slot->len  = payload;
          memset(slot->reserved, 0, sizeof(slot->reserved));
          memcpy(slot->data, &e->rx_msg[1], payload);
          if (payload < LUMP_MAX_PAYLOAD)
            {
              memset(slot->data + payload, 0,
                     LUMP_MAX_PAYLOAD - payload);
            }
          e->dq_head = (uint8_t)((e->dq_head + 1) % LUMP_DATA_QUEUE);
          e->dq_count++;
          nxmutex_unlock(&e->dq_lock);

          /* Fire `on_data` callback.  Snapshot the cb under tx_lock so
           * we can safely call it after dropping the lock — `lump_attach`
           * uses the same lock to install / clear callbacks.
           */

          nxmutex_lock(&e->cb_lock);
          lump_on_data_t cb_local = e->cb_attached ? e->cb.on_data : NULL;
          void          *priv     = e->cb_attached ? e->cb.priv    : NULL;
          if (cb_local != NULL)
            {
              e->in_callback = true;
            }
          nxmutex_unlock(&e->cb_lock);

          if (cb_local != NULL)
            {
              cb_local(e->port, data_mode, &e->rx_msg[1], payload, priv);
              nxmutex_lock(&e->cb_lock);
              e->in_callback = false;
              nxmutex_unlock(&e->cb_lock);
            }
          break;
        }
    }

  return OK;
}

/****************************************************************************
 * SYNC sequence (pybricks `synchronize_thread` port)
 ****************************************************************************/

static int lump_sync(struct lump_engine_s *e)
{
  int ret;

  e->state = LUMP_ST_SYNCING;

  /* 1. Send `CMD SPEED 115200` to ask the device to talk fast. */

  uint8_t speed_payload[4];
  size_t  padded;
  uint8_t header = lump_cmd_header(LUMP_CMD_SPEED, 4, &padded);

  lump_put_u32_le(speed_payload, LUMP_BAUD_INITIAL);

  ret = lump_send_msg(e, header, speed_payload, padded, true);
  if (ret < 0)
    {
      return ret;
    }

  /* 2. Probe for ACK at fast baud.  Pybricks waits 10 ms for any byte;
   * if it isn't ACK or we time out, drop to 2400 baud (EV3 mode).
   */

  uint8_t probe;
  ret = lump_uart_read_byte(e->port, &probe, 10);
  if (ret == -ETIMEDOUT || (ret == OK && probe != LUMP_SYS_ACK))
    {
      ret = lump_uart_set_baud(e->port, LUMP_BAUD_FALLBACK);
      if (ret < 0)
        {
          return ret;
        }

      /* Discard any bytes captured at 115200 while the device was
       * actually streaming at 2400 — they would corrupt the header
       * resync below otherwise.
       */

      lump_uart_flush_rx(e->port);
    }
  else if (ret < 0)
    {
      return ret;
    }

  /* 3+4. Resync to a valid `CMD TYPE` frame.  Pybricks structure: the
   *      inner header search has no bound — keep reading until we see
   *      the magic byte.  After that, read type_id + checksum, validate
   *      ID range + checksum.  On bad ID/checksum, increment a session-
   *      wide error counter and restart the header search.  Bail after
   *      10 consecutive bad IDs.
   */

  e->err_count = 0;

  for (;;)
    {
      /* Header search loop — no count, must see CMD_TYPE byte. */

      for (;;)
        {
          uint8_t hdr;
          ret = lump_uart_read_byte(e->port, &hdr, LUMP_IO_TIMEOUT_MS);
          if (ret == -ETIMEDOUT)
            {
              continue;  /* keep waiting; device may still be syncing */
            }
          if (ret < 0)
            {
              return ret;
            }
          e->rx_bytes++;

          if (hdr == (LUMP_MSG_TYPE_CMD | LUMP_CMD_TYPE))
            {
              e->rx_msg[0] = hdr;
              break;
            }
          /* otherwise: keep looking */
        }

      /* Read type_id + checksum. */

      for (size_t i = 1; i < 3; i++)
        {
          ret = lump_uart_read_byte(e->port, &e->rx_msg[i],
                                    LUMP_IO_TIMEOUT_MS);
          if (ret < 0)
            {
              return ret;
            }
          e->rx_bytes++;
        }
      e->rx_msg_size = 3;

      bool bad_id = (e->rx_msg[1] < LUMP_TYPE_ID_MIN ||
                     e->rx_msg[1] > LUMP_TYPE_ID_MAX);
      uint8_t cs  = lump_xor_checksum(e->rx_msg, 2);
      bool bad_cs = (cs != e->rx_msg[2]);

      if (bad_id || bad_cs)
        {
          if (++e->err_count > 10)
            {
              return -EILSEQ;
            }
          continue;  /* re-enter header search */
        }

      /* Good frame — parse and exit the resync loop. */

      ret = lump_parse_msg(e);
      if (ret < 0)
        {
          return ret;
        }
      break;
    }

  syslog(LOG_INFO, "lump: port %c: type_id=%u\n",
         'A' + e->port, e->info.type_id);

  /* 5. INFO loop.  Read frames until SYS_ACK or error. */

  e->state      = LUMP_ST_INFO;
  e->last_idx   = 0;
  e->last_count = 0;

  for (;;)
    {
      ret = lump_recv_msg(e, LUMP_IO_TIMEOUT_MS);
      if (ret == -EBADMSG || ret == -EILSEQ)
        {
          continue;  /* skip malformed frame */
        }
      if (ret < 0)
        {
          /* Dump the last-N frame ring for forensics. */

          char trace[80];
          size_t off = 0;
          uint8_t n = e->last_count < LUMP_LASTN ?
                      e->last_count : LUMP_LASTN;
          uint8_t start = (uint8_t)((e->last_idx + LUMP_LASTN - n) %
                                    LUMP_LASTN);
          for (uint8_t i = 0; i < n; i++)
            {
              uint8_t k = (uint8_t)((start + i) % LUMP_LASTN);
              int w = snprintf(trace + off, sizeof(trace) - off,
                               "%02x:%02x ",
                               e->last_hdr[k], e->last_cmd2[k]);
              if (w <= 0 || (size_t)w >= sizeof(trace) - off) break;
              off += (size_t)w;
            }

          syslog(LOG_WARNING,
                 "lump: port %c: INFO timeout flags=0x%lx new_mode=%u "
                 "num_modes=%u rx=%lu ore=%u last=[%s]\n",
                 'A' + e->port, (unsigned long)e->info_flags,
                 e->new_mode, (unsigned)e->info.num_modes,
                 (unsigned long)e->rx_bytes,
                 (unsigned)lump_uart_get_ore_count(e->port),
                 trace);
          return ret;
        }

      /* Record last-N frame for forensics. */

