owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport_lump.c
      e->last_hdr[e->last_idx]  = e->rx_msg[0];
      e->last_cmd2[e->last_idx] = (uint8_t)
          (e->rx_msg_size >= 2 ? e->rx_msg[1] : 0);
      e->last_idx = (uint8_t)((e->last_idx + 1) % LUMP_LASTN);
      if (e->last_count < LUMP_LASTN)
        {
          e->last_count++;
        }

      /* Detect SYS_ACK before parse so we can break the loop. */

      if (e->rx_msg[0] == (LUMP_MSG_TYPE_SYS | LUMP_SYS_ACK))
        {
          if ((e->info_flags & LUMP_IF_REQUIRED) != LUMP_IF_REQUIRED)
            {
              syslog(LOG_WARNING,
                     "lump: port %c: ACK before required INFO "
                     "(flags=0x%lx)\n",
                     'A' + e->port, (unsigned long)e->info_flags);
              return -EILSEQ;
            }
          break;
        }

      ret = lump_parse_msg(e);
      if (ret == -EILSEQ)
        {
          syslog(LOG_WARNING,
                 "lump: port %c: parse err on hdr=0x%02x size=%u\n",
                 'A' + e->port, e->rx_msg[0],
                 (unsigned)e->rx_msg_size);
          return ret;
        }
      /* -EBADMSG = drop frame, continue */
    }

  /* 6. Reply with SYS_ACK, wait 10 ms, switch to negotiated baud. */

  ret = lump_send_sys(e, LUMP_SYS_ACK);
  if (ret < 0)
    {
      return ret;
    }

  nxsig_usleep(LUMP_ACK_BAUD_DELAY_MS * 1000);

  if (e->new_baud_rate != LUMP_BAUD_INITIAL)
    {
      ret = lump_uart_set_baud(e->port, e->new_baud_rate);
      if (ret < 0)
        {
          return ret;
        }
    }

  /* 7. Mark synced.  Phase 2 enters keepalive idle; Phase 3 will run
   * the DATA state machine here instead.
   */

  nxmutex_lock(&e->info_lock);
  e->info.flags |= LUMP_FLAG_SYNCED;
  e->info.baud   = e->new_baud_rate;
  uint8_t default_mode = e->info.current_mode;
  uint8_t num_modes    = e->info.num_modes;
  nxmutex_unlock(&e->info_lock);

  e->state = LUMP_ST_DATA;

  syslog(LOG_INFO,
         "lump: port %c: SYNCED type=%u modes=%u baud=%lu\n",
         'A' + e->port, e->info.type_id,
         (unsigned)e->info.num_modes,
         (unsigned long)e->info.baud);

  /* Issue #81: auto-enqueue a CMD SELECT for the device's default
   * (current) mode after SYNC.  Mirrors the pybricks reference
   * (`pbio/drv/legodev/legodev_pup_uart.c:903`); without this, any
   * device whose default mode does not auto-emit DATA gets torn
   * down by the 600 ms no-DATA watchdog before any consumer can
   * issue a SELECT.  All SPIKE-family devices observed to date
   * auto-stream, so this is defensive parity.  The data loop drains
   * `pending_select` on the next TX window.
   */

  if (default_mode < num_modes)
    {
      nxmutex_lock(&e->tx_lock);
      e->pending_select       = true;
      e->pending_select_mode  = default_mode;
      nxmutex_unlock(&e->tx_lock);
    }

  /* Fire `on_sync` so an attached consumer (motor / sensor driver) can
   * hydrate its info cache and emit a connect sentinel on every fresh
   * SYNCING -> DATA transition (boot, re-sync after backoff, etc.).
   * Lock-released-then-fire pattern matches `on_data` / `on_error` so
   * same-port API re-entry from inside the callback is rejected via
   * `in_callback`.
   */
  {
    nxmutex_lock(&e->cb_lock);
    lump_on_sync_t sync_cb   = e->cb_attached ? e->cb.on_sync : NULL;
    void          *sync_priv = e->cb_attached ? e->cb.priv    : NULL;
    if (sync_cb != NULL)
      {
        e->in_callback = true;
      }
    nxmutex_unlock(&e->cb_lock);

    if (sync_cb != NULL)
      {
        struct lump_device_info_s snap;
        nxmutex_lock(&e->info_lock);
        memcpy(&snap, &e->info, sizeof(snap));
        nxmutex_unlock(&e->info_lock);

        sync_cb(e->port, &snap, sync_priv);

        nxmutex_lock(&e->cb_lock);
        e->in_callback = false;
        nxmutex_unlock(&e->cb_lock);
      }
  }

  return OK;
}

/****************************************************************************
 * Watchdog supervisor — Phase 4
 *
 * Pets per DATA-loop iteration; on stall, fires from the system timer
 * IRQ context and just sets a flag + posts the wakeup sem so the
 * kthread can run release/register/backoff in thread context.
 ****************************************************************************/

static void lump_wdog_handler(wdparm_t arg)
{
  struct lump_engine_s *e = (struct lump_engine_s *)arg;
  e->wdog_stall = true;
  nxsem_post(&e->wakeup);
}

static inline void lump_wdog_pet(struct lump_engine_s *e)
{
  wd_start(&e->wdog, MSEC2TICK(LUMP_WATCHDOG_MS),
           lump_wdog_handler, (wdparm_t)e);
}

static inline void lump_wdog_cancel(struct lump_engine_s *e)
{
  wd_cancel(&e->wdog);
}

/****************************************************************************
 * DATA loop — Phase 3: receive DATA frames, send keepalive, drain TX queue
 ****************************************************************************/

/* Send `CMD EXT_MODE` to multiplex mode-byte values past 7.  Required
 * before each `CMD SELECT` / DATA TX on Powered Up devices, even when
 * the target mode is < 8.
 */

static int lump_send_ext_mode(struct lump_engine_s *e, uint8_t mode)
{
  uint8_t adder = (mode > 7) ? 8 : 0;
  uint8_t hdr   = (uint8_t)(LUMP_MSG_TYPE_CMD | LUMP_CMD_EXT_MODE);
  /* size_code 0 → 1-byte payload */
  return lump_send_msg(e, hdr, &adder, 1, true);
}

/* Send `CMD SELECT <mode_lo>`.  Caller is responsible for first sending
 * `CMD EXT_MODE` if the mode is >= 8.
 */

static int lump_send_select(struct lump_engine_s *e, uint8_t mode)
{
  uint8_t hdr     = (uint8_t)(LUMP_MSG_TYPE_CMD | LUMP_CMD_SELECT);
  uint8_t mode_lo = (uint8_t)(mode & LUMP_MSG_CMD_MASK);
  return lump_send_msg(e, hdr, &mode_lo, 1, true);
}

/* Send a DATA frame for a writable mode.  Pads payload to the smallest
 * power-of-2 size that fits (1/2/4/8/16/32 bytes) and OR's the mode
 * (mod 8) into the header CMD field.  Caller has already issued
 * `CMD EXT_MODE` for `mode >= 8`.
 */

static int lump_send_data_frame(struct lump_engine_s *e, uint8_t mode,
                                const uint8_t *buf, size_t len)
{
  size_t  padded;
  uint8_t hdr_cmd_byte = (uint8_t)(mode & LUMP_MSG_CMD_MASK);
  uint8_t header;
  uint8_t size_code;

  if (len == 0 || len > LUMP_MAX_PAYLOAD)
    {
      return -EINVAL;
    }

  if (len <= 1)        { size_code = 0u; padded = 1; }
  else if (len <= 2)   { size_code = 1u; padded = 2; }
  else if (len <= 4)   { size_code = 2u; padded = 4; }
  else if (len <= 8)   { size_code = 3u; padded = 8; }
  else if (len <= 16)  { size_code = 4u; padded = 16; }
  else                 { size_code = 5u; padded = 32; }

