owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport_lump.c
  header = (uint8_t)(LUMP_MSG_TYPE_DATA |
                     ((size_code << LUMP_MSG_SIZE_SHIFT) &
                      LUMP_MSG_SIZE_MASK) |
                     hdr_cmd_byte);

  /* Build padded payload (zero-fill the tail). */

  uint8_t pad[LUMP_MAX_PAYLOAD];
  memcpy(pad, buf, len);
  if (padded > len)
    {
      memset(pad + len, 0, padded - len);
    }

  return lump_send_msg(e, header, pad, padded, true);
}

/* Drain pending TX requests posted by `lump_select_mode` / `lump_send_data`.
 * Called from the kthread context only, so we can take `tx_lock`, copy
 * the request, drop the lock, then issue the TX without blocking the
 * user-side ioctl.
 */

static int lump_drain_tx_requests(struct lump_engine_s *e)
{
  bool    do_select = false;
  bool    do_send   = false;
  uint8_t sel_mode  = 0;
  uint8_t send_mode = 0;
  uint8_t send_buf[LUMP_MAX_PAYLOAD];
  uint8_t send_len  = 0;

  nxmutex_lock(&e->tx_lock);
  if (e->pending_select)
    {
      do_select          = true;
      sel_mode           = e->pending_select_mode;
      e->pending_select  = false;
    }
  if (e->pending_send)
    {
      do_send            = true;
      send_mode          = e->pending_send_mode;
      send_len           = e->pending_send_len;
      memcpy(send_buf, e->pending_send_buf, send_len);
      e->pending_send    = false;
    }
  nxmutex_unlock(&e->tx_lock);

  if (do_select)
    {
      int ret = lump_send_ext_mode(e, sel_mode);
      if (ret < 0)
        {
          return ret;
        }
      ret = lump_send_select(e, sel_mode);
      if (ret < 0)
        {
          return ret;
        }
    }

  if (do_send)
    {
      int ret = lump_send_ext_mode(e, send_mode);
      if (ret < 0)
        {
          return ret;
        }
      ret = lump_send_data_frame(e, send_mode, send_buf, send_len);
      if (ret < 0)
        {
          return ret;
        }
    }

  return OK;
}

/* (DATA-loop / watchdog constants moved to the file-scope #define block
 * near the top of the file so the wdog handler can reference them.)
 */

static int lump_data_loop(struct lump_engine_s *e)
{
  /* Drain any tail bytes from sync (SYS_ACK we sent might trigger a
   * brief device echo / pause) before the steady-state loop.
   */

  lump_uart_flush_rx(e->port);

  clock_t  last_keepalive = clock_systime_ticks();
  uint8_t  miss_count     = 0;
  bool     data_rec       = false;

  /* Phase 4: arm the per-port watchdog and pet on each iteration. */

  e->wdog_stall = false;
  lump_wdog_pet(e);

  for (;;)
    {
      /* Stall detected by wdog (IRQ ctx) — exit the loop so the
       * kthread can run release/register/backoff.
       */

      if (e->wdog_stall)
        {
          syslog(LOG_WARNING,
                 "lump: port %c: watchdog stall, resetting session\n",
                 'A' + e->port);
          lump_wdog_cancel(e);
          return -ETIMEDOUT;
        }

      /* Try to read one frame within a short slice — we want the loop
       * to come around to the keepalive / TX-drain checks at least
       * every ~20 ms even if no DATA frames are arriving.
       */

      int ret = lump_recv_msg(e, LUMP_DATA_RECV_SLICE_MS);
      if (ret == OK)
        {
          if ((e->rx_msg[0] & LUMP_MSG_TYPE_MASK) == LUMP_MSG_TYPE_DATA)
            {
              data_rec = true;
            }
          (void)lump_parse_msg(e);
        }
      /* -EBADMSG / -EILSEQ / -ETIMEDOUT all fall through to keepalive. */

      /* Keepalive cadence. */

      clock_t now = clock_systime_ticks();
      if ((sclock_t)(now - last_keepalive) >=
          (sclock_t)MSEC2TICK(LUMP_KEEPALIVE_MS))
        {
          if (data_rec)
            {
              miss_count = 0;
            }
          else if (++miss_count > LUMP_DATA_MISS_LIMIT)
            {
              syslog(LOG_INFO,
                     "lump: port %c: no DATA for %lu ms, disconnecting\n",
                     'A' + e->port,
                     (unsigned long)(LUMP_DATA_MISS_LIMIT *
                                     LUMP_KEEPALIVE_MS));
              nxmutex_lock(&e->info_lock);
              e->info.flags &= (uint8_t)~LUMP_FLAG_DATA_OK;
              nxmutex_unlock(&e->info_lock);
              lump_wdog_cancel(e);
              return -ETIMEDOUT;
            }

          int wret = lump_send_sys(e, LUMP_SYS_NACK);
          if (wret < 0)
            {
              lump_wdog_cancel(e);
              return wret;
            }
          last_keepalive = now;
          data_rec       = false;
        }

      /* Drain user-posted TX requests. */

      ret = lump_drain_tx_requests(e);
      if (ret < 0)
        {
          lump_wdog_cancel(e);
          return ret;
        }

      /* External shutdown signal? */

      if (nxsem_trywait(&e->wakeup) == OK)
        {
          /* Could be wdog stall (set flag), genuine reset, or stale
           * post — wdog flag check at loop top handles the wdog case.
           */

          if (e->wdog_stall)
            {
              continue;
            }
          lump_wdog_cancel(e);
          return -EINTR;
        }

      /* Pet the watchdog before going around again. */

      lump_wdog_pet(e);
    }
}

/****************************************************************************
 * Per-session driver — one handoff -> sync -> keepalive -> release cycle
 ****************************************************************************/

static int lump_run_session(struct lump_engine_s *e)
{
  int ret;
  const struct legoport_pin_s *pins = e->pins;

  /* Switch pins to UART AF.  The DCM left them in GPIO scan state. */

  stm32_configgpio(pins->uart_buf_lo);   /* enable line buffer */
  stm32_configgpio(pins->uart_tx_af);    /* TX -> USART AF */
  stm32_configgpio(pins->uart_rx_af);    /* RX -> USART AF */

  /* Open USART at LPF2 baud — the engine drops to 2400 internally if
   * the device doesn't acknowledge.
   */

  ret = lump_uart_open(e->port, LUMP_BAUD_INITIAL);
  if (ret < 0)
    {
      return ret;
    }

  ret = lump_sync(e);
  if (ret < 0)
    {
      return ret;
    }

  /* Phase 3: full DATA state machine — receive DATA frames, send
   * 100 ms `SYS_NACK` keepalive, drain pending TX from user-space.
   */

