owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport_lump.c
  return lump_data_loop(e);
}

/****************************************************************************
 * Per-port kthread main loop
 ****************************************************************************/

static int lump_kthread_entry(int argc, FAR char *argv[])
{
  if (argc < 2)
    {
      return -EINVAL;
    }

  int port = atoi(argv[1]);
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT)
    {
      return -EINVAL;
    }

  struct lump_engine_s *e = &g_lump[port];

  for (;;)
    {
      /* 1. Wait for handoff (sem posted by DCM CB). */

      int ret = nxsem_wait_uninterruptible(&e->wakeup);
      if (ret < 0)
        {
          continue;
        }

      if (!e->handoff_pending)
        {
          /* Spurious wake (e.g., legacy posts).  Loop. */
          continue;
        }
      e->handoff_pending = false;

      /* 2. Run a session: open USART, sync, keepalive until error. */

      lump_reset_session_state(e);
      ret = lump_run_session(e);

      /* 3. Tear down: close USART, give pins back to DCM, re-register
       *    the handoff so the next plug-in cycles us back here.
       *    Mark the engine state as ERR so `lump status` reflects the
       *    transient post-session period instead of stale DATA.
       */

      e->state = LUMP_ST_ERR;

      lump_uart_close(e->port);
      stm32_legoport_release_uart(e->port);

      nxmutex_lock(&e->info_lock);
      bool was_synced = (e->info.flags & LUMP_FLAG_SYNCED) != 0;
      e->info.flags = 0;  /* clear SYNCED / DATA_OK */
      uint8_t err_mode = e->info.current_mode;
      nxmutex_unlock(&e->info_lock);

      /* Fire `on_error` so an attached consumer (motor / sensor driver)
       * can flush its state and publish a disconnect sentinel.  Fires on
       * every session-ending transition into ERR — sync failure, missed
       * keepalives, watchdog stall — `data == NULL && len == 0` is the
       * agreed disconnect convention.  Lock-released-then-fire matches
       * `on_data` / `on_sync`; same-port API re-entry is gated by
       * `in_callback`.
       */
      {
        nxmutex_lock(&e->cb_lock);
        lump_on_data_t err_cb   = e->cb_attached ? e->cb.on_error : NULL;
        void          *err_priv = e->cb_attached ? e->cb.priv     : NULL;
        if (err_cb != NULL)
          {
            e->in_callback = true;
          }
        nxmutex_unlock(&e->cb_lock);

        if (err_cb != NULL)
          {
            err_cb(e->port, err_mode, NULL, 0, err_priv);

            nxmutex_lock(&e->cb_lock);
            e->in_callback = false;
            nxmutex_unlock(&e->cb_lock);
          }
      }

      stm32_legoport_register_uart_handoff(e->port, lump_handoff_cb, e);
      e->dcm_cb_registered = true;

      /* 4. Backoff before accepting the next handoff (capped exp). */

      uint32_t sleep_ms = g_backoff_ms[e->backoff_step];
      if (ret == OK || ret == -EINTR || was_synced)
        {
          /* Either an explicit clean exit, or a session that reached
           * SYNCED before being torn down (typically a physical
           * disconnect during normal operation — `ret = -110` from the
           * 600 ms no-DATA watchdog).  Neither is a SYNC-phase failure,
           * so reset backoff to 0 (Issue #81).  Without this, every
           * successful plug/unplug cycle would escalate the backoff
           * and a handful of cycles would bury the engine in a 30 s
           * sleep, masking subsequent device insertions.
           */

          e->backoff_step = 0;
          sleep_ms        = g_backoff_ms[0];
        }
      else
        {
          syslog(LOG_WARNING,
                 "lump: port %c session ended ret=%d step=%u sleep=%lu ms\n",
                 'A' + e->port, ret, e->backoff_step,
                 (unsigned long)sleep_ms);

          if (e->backoff_step < LUMP_BACKOFF_MAX)
            {
              e->backoff_step++;
            }
        }

      nxsig_usleep(sleep_ms * 1000);

      /* Backoff complete — engine is now idle, waiting for the next
       * handoff sem post.  `lump_reset_session_state` will set IDLE
       * again at the top of the next iteration.
       */

      e->state = LUMP_ST_IDLE;
    }

  return 0;
}

/****************************************************************************
 * Public API (board_lump.h)
 ****************************************************************************/

int lump_get_info(int port, struct lump_device_info_s *out)
{
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT || out == NULL)
    {
      return -EINVAL;
    }

  struct lump_engine_s *e = &g_lump[port];

  nxmutex_lock(&e->info_lock);
  if ((e->info.flags & LUMP_FLAG_SYNCED) == 0)
    {
      nxmutex_unlock(&e->info_lock);
      return -EAGAIN;
    }
  memcpy(out, &e->info, sizeof(*out));
  nxmutex_unlock(&e->info_lock);

  return OK;
}

int lump_get_status(int port, uint8_t *flags_out,
                    uint32_t *rx_bytes_out,
                    uint32_t *tx_bytes_out)
{
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT)
    {
      return -EINVAL;
    }

  struct lump_engine_s *e = &g_lump[port];

  nxmutex_lock(&e->info_lock);
  if (flags_out != NULL)
    {
      *flags_out = e->info.flags;
    }
  nxmutex_unlock(&e->info_lock);

  if (rx_bytes_out != NULL)
    {
      *rx_bytes_out = e->rx_bytes;
    }
  if (tx_bytes_out != NULL)
    {
      *tx_bytes_out = e->tx_bytes;
    }

  return OK;
}

int lump_get_status_full(int port, struct lump_status_full_s *out)
{
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT || out == NULL)
    {
      return -EINVAL;
    }

  struct lump_engine_s *e = &g_lump[port];

  memset(out, 0, sizeof(*out));

  nxmutex_lock(&e->info_lock);
  out->state        = (uint8_t)e->state;
  out->flags        = e->info.flags;
  out->type_id      = e->info.type_id;
  out->current_mode = e->info.current_mode;
  out->baud         = e->info.baud;
  nxmutex_unlock(&e->info_lock);

  out->rx_bytes     = e->rx_bytes;
  out->tx_bytes     = e->tx_bytes;
  out->backoff_step = e->backoff_step;

  nxmutex_lock(&e->dq_lock);
  out->dq_dropped   = e->dq_dropped;
  nxmutex_unlock(&e->dq_lock);

  /* Stack high-water — needs CONFIG_STACK_COLORATION (set in defconfig).
   * `up_check_tcbstack(tcb, full_size)` walks from the stack base up,
   * skipping the still-poisoned bottom and returning the deepest the
   * stack ever grew (bytes used).  Passing 0 returns 0, so we have to
   * give it the full allocation size.
   */

