owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport_lump.c
#ifdef CONFIG_STACK_COLORATION
  if (e->kthread > 0)
    {
      FAR struct tcb_s *tcb = nxsched_get_tcb(e->kthread);
      if (tcb != NULL)
        {
          out->stk_size = (uint32_t)tcb->adj_stack_size;
          out->stk_used = (uint32_t)up_check_tcbstack(tcb,
                                                     tcb->adj_stack_size);
        }
    }
#endif

  return OK;
}

int lump_attach(int port, const struct lump_callbacks_s *cb)
{
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT || cb == NULL)
    {
      return -EINVAL;
    }

  struct lump_engine_s *e = &g_lump[port];

  /* Reject same-port re-entry from inside an existing callback —
   * keeps the on_data dispatch path single-threaded.
   */

  nxmutex_lock(&e->cb_lock);
  if (e->in_callback)
    {
      nxmutex_unlock(&e->cb_lock);
      return -EDEADLK;
    }
  if (e->cb_attached)
    {
      nxmutex_unlock(&e->cb_lock);
      return -EBUSY;
    }
  e->cb           = *cb;
  e->cb_attached  = true;
  nxmutex_unlock(&e->cb_lock);

  /* If the engine is already SYNCED, fire `on_sync` synchronously after
   * dropping the cb_lock — same-port API re-entry is forbidden but
   * cross-port and `lump_get_*` are fine.
   */

  if (cb->on_sync != NULL)
    {
      struct lump_device_info_s snap;
      nxmutex_lock(&e->info_lock);
      bool synced = (e->info.flags & LUMP_FLAG_SYNCED) != 0;
      if (synced)
        {
          memcpy(&snap, &e->info, sizeof(snap));
        }
      nxmutex_unlock(&e->info_lock);

      if (synced)
        {
          nxmutex_lock(&e->cb_lock);
          e->in_callback = true;
          nxmutex_unlock(&e->cb_lock);

          cb->on_sync(port, &snap, cb->priv);

          nxmutex_lock(&e->cb_lock);
          e->in_callback = false;
          nxmutex_unlock(&e->cb_lock);
        }
    }

  return OK;
}

int lump_detach(int port)
{
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT)
    {
      return -EINVAL;
    }

  struct lump_engine_s *e = &g_lump[port];

  nxmutex_lock(&e->cb_lock);
  if (e->in_callback)
    {
      nxmutex_unlock(&e->cb_lock);
      return -EDEADLK;
    }
  e->cb_attached  = false;
  memset(&e->cb, 0, sizeof(e->cb));
  nxmutex_unlock(&e->cb_lock);

  return OK;
}

int lump_select_mode(int port, uint8_t mode)
{
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT)
    {
      return -EINVAL;
    }

  struct lump_engine_s *e = &g_lump[port];

  nxmutex_lock(&e->info_lock);
  if ((e->info.flags & LUMP_FLAG_SYNCED) == 0)
    {
      nxmutex_unlock(&e->info_lock);
      return -EAGAIN;
    }
  if (mode >= e->info.num_modes)
    {
      nxmutex_unlock(&e->info_lock);
      return -EINVAL;
    }
  nxmutex_unlock(&e->info_lock);

  nxmutex_lock(&e->tx_lock);
  e->pending_select       = true;
  e->pending_select_mode  = mode;
  nxmutex_unlock(&e->tx_lock);

  return OK;
}

int lump_send_data(int port, uint8_t mode, const uint8_t *buf, size_t len)
{
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT ||
      buf == NULL || len == 0 || len > LUMP_MAX_PAYLOAD)
    {
      return -EINVAL;
    }

  struct lump_engine_s *e = &g_lump[port];

  nxmutex_lock(&e->info_lock);
  if ((e->info.flags & LUMP_FLAG_SYNCED) == 0)
    {
      nxmutex_unlock(&e->info_lock);
      return -EAGAIN;
    }
  if (mode >= e->info.num_modes)
    {
      nxmutex_unlock(&e->info_lock);
      return -EINVAL;
    }
  if (!e->info.modes[mode].writable)
    {
      nxmutex_unlock(&e->info_lock);
      return -ENOTSUP;
    }
  nxmutex_unlock(&e->info_lock);

  nxmutex_lock(&e->tx_lock);
  e->pending_send       = true;
  e->pending_send_mode  = mode;
  e->pending_send_len   = (uint8_t)len;
  memcpy(e->pending_send_buf, buf, len);
  nxmutex_unlock(&e->tx_lock);

  return OK;
}

/* Pop one DATA frame from the per-port ring, used by the
 * `LEGOPORT_LUMP_POLL_DATA` ioctl.  Returns -EAGAIN if empty.
 */

int lump_pop_data_frame(int port, struct lump_data_frame_s *out)
{
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT || out == NULL)
    {
      return -EINVAL;
    }

  struct lump_engine_s *e = &g_lump[port];

  nxmutex_lock(&e->dq_lock);
  if (e->dq_count == 0)
    {
      nxmutex_unlock(&e->dq_lock);
      return -EAGAIN;
    }
  *out       = e->dq[e->dq_tail];
  e->dq_tail = (uint8_t)((e->dq_tail + 1) % LUMP_DATA_QUEUE);
  e->dq_count--;
  nxmutex_unlock(&e->dq_lock);

  return OK;
}

/****************************************************************************
 * Engine bring-up (called from stm32_bringup.c)
 ****************************************************************************/

int stm32_legoport_lump_register(void)
{
  if (g_lump_initialized)
    {
      return -EALREADY;
    }

  for (int p = 0; p < BOARD_LEGOPORT_COUNT; p++)
    {
      struct lump_engine_s *e = &g_lump[p];

      memset(e, 0, sizeof(*e));
      e->port = (uint8_t)p;
      nxsem_init(&e->wakeup, 0, 0);
      nxmutex_init(&e->info_lock);
      nxmutex_init(&e->tx_lock);
      nxmutex_init(&e->dq_lock);
      nxmutex_init(&e->cb_lock);

      /* Pre-create the per-port kthread.  It blocks immediately on
       * `wakeup`; the DCM CB is what unblocks it (or `lump reset`
       * later).  Stack is allocated once at boot per the plan note.
       */

      char name[16];
      char arg_port[4];
      char *argv[2];

      snprintf(name, sizeof(name), "lump-%c", 'A' + p);
      snprintf(arg_port, sizeof(arg_port), "%d", p);
      argv[0] = arg_port;
      argv[1] = NULL;

      e->kthread = kthread_create(name,
                                  LUMP_KTHREAD_PRIO,
                                  LUMP_KTHREAD_STACK,
                                  lump_kthread_entry,
                                  argv);
      if (e->kthread < 0)
        {
          syslog(LOG_ERR,
                 "lump: kthread_create(port %c) failed: %d\n",
                 'A' + p, (int)e->kthread);
          return (int)e->kthread;
        }

      /* Register the DCM handoff CB.  When the port detects
       * UNKNOWN_UART, this CB fires and posts e->wakeup.
       */

      int ret = stm32_legoport_register_uart_handoff(p, lump_handoff_cb, e);
      if (ret < 0)
        {
          syslog(LOG_ERR,
                 "lump: register_uart_handoff(port %c) failed: %d\n",
                 'A' + p, ret);
          return ret;
        }
      e->dcm_cb_registered = true;
    }

  g_lump_initialized = true;

  syslog(LOG_INFO,
         "lump: 6 kthreads pre-created, DCM handoff registered\n");
  return OK;
}

#endif /* CONFIG_LEGO_LUMP */
